# Below Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegment..::..Below Property
DimensionSegment Class See Also
---
The text shown below the segment's value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Below { get; set; }
```

Visual Basic
---
```text
Public Property Below As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Below {
	String^ get ();
	void set (String^ value);
}
```

# See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace